results/mpi_benchmark/sysbench_fio/fio_local/oc_sys-fio_local.worker00_1threads.2/stdout
sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     7211.64
    fsyncs/s:                     9231.10

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               112.68

General statistics:
    total time:                          10.0104s
    total number of events:              164490

Latency (ms):
         min:                                    0.00
         avg:                                    0.06
         max:                                    9.74
         95th percentile:                        0.21
         sum:                                 9953.95

Threads fairness:
    events (avg/stddev):           164490.0000/0.00
    execution time (avg/stddev):   9.9540/0.00

sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      481230.84
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  7519.23
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0001s
    total number of events:              4812916

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                    0.07
         95th percentile:                        0.00
         sum:                                 9277.48

Threads fairness:
    events (avg/stddev):           4812916.0000/0.00
    execution time (avg/stddev):   9.2775/0.00

DONE